Revit 2022 API
AnalyticalModelColumn.BaseExtension Property
 The base extension option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
public StickElementExtension BaseExtension { get; set; }
Visual Basic
Public Property BaseExtension As StickElementExtension
	Get
	Set
Visual C++
public:
property StickElementExtension BaseExtension {
	StickElementExtension get ();
	void set (StickElementExtension value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModelColumn Class
Autodesk.Revit.DB.Structure Namespace